package com.yj.nz.mota.motav2;

/**
 * ClassName:Maps
 * Package:com.yj.nz.mota.motav2
 * Description:描述
 *
 * @Date:2022/10/15 8:56
 * @Author:NieZheng
 * @Version:1.0
 */
public class Maps {

    // 魔塔54层 每一层 13 * 13 大小 总共169
    public static String[][] maps = new String[54][169];

    // 先初始化数据 先有两层数据 保证上下楼梯使用
    // x：墙 h：勇士 数字：怪物 （1~9） ijk：黄蓝红钥匙 IJK：黄红蓝门
    // n p:上下楼梯 r b：红蓝血瓶 a d:红蓝宝石 s：商店 空格：空地
    static{
        maps[0] = new String[] {
                "x","x","x","x","x","x","x","x","x","x","x","x","x",
                "x","p"," ","i","1","2","1"," "," "," "," "," ","x",
                "x","x","x","x","x","x","x","x","x","x","x"," ","x",
                "x","r"," ","4","I"," ","x","r","i","r","x"," ","x",
                "x","i","4","a","x"," ","x","r","i","r","x"," ","x",
                "x","x","I","x","x"," ","x","x","x","5","x"," ","x",
                "x","i","7"," ","x"," ","I","6","1","3","x"," ","x",
                "x","d"," ","j","x"," ","x","x","x","x","x"," ","x",
                "x","x","I","x","x"," "," "," "," "," "," "," ","x",
                "x"," ","7"," ","x","x","K","x","x","x","I","x","x",
                "x","r","b","i","x"," ","h"," ","x","i","8","j","x",
                "x","r"," ","i","x"," ","s"," ","x","i","i","i","x",
                "x","x","x","x","x","x","x","x","x","x","x","x","x"
        };
        maps[1] = new String[] {
                "x","x","x","x","x","x","x","x","x","x","x","x","x",
                "x"," "," ","i","1","2","1"," "," "," "," "," ","x",
                "x","x","x","x","x","x","x","x","x","x","x"," ","x",
                "x","r"," ","4","I"," ","x","r","i","r","x"," ","x",
                "x","i","4","a","x","p","x","r","i","r","x"," ","x",
                "x","x","I","x","x"," ","x","x","x","5","x"," ","x",
                "x","i","7"," ","x"," ","I","6","1","3","x"," ","x",
                "x","d"," ","j","x"," ","x","x","x","x","x"," ","x",
                "x","x","I","x","x"," "," "," "," "," "," "," ","x",
                "x"," ","7"," ","x","x","K","x","x","x","I","x","x",
                "x","r","b","i","x"," "," "," ","x","i","8","j","x",
                "x","r"," ","i","x"," ","s"," ","x","i","x","i","x",
                "x","x","x","x","x","x","x","x","x","x","x","x","x"
        };
    }
}
