package com.yj.nz.mota.motav1;

public class Maps {
	//这个游戏，有27层，每一层，是13*13大小的地图        不要用三维数组，要用二维数组
	public static String[][] maps = new String[27][169];

	//这个地图，一开始就要创建好
	static {
		//假设时间
		//x代表墙   h代表勇士    怪物：数字     r    b    a   d     空地：空格
		//i j k 钥匙    I J K 门              n下楼梯    p上楼梯
		maps[0] = new String[] {
			"x","x","x","x","x","x","x","x","x","x","x","x","x",
			"x","p"," ","i","1","2","1"," "," "," "," "," ","x",
			"x","x","x","x","x","x","x","x","x","x","x"," ","x",
			"x","r"," ","4","I"," ","x","r","i","r","x"," ","x",
			"x","i","4","a","x"," ","x","r","i","r","x"," ","x",
			"x","x","I","x","x"," ","x","x","x","5","x"," ","x",
			"x","i","7"," ","x"," ","I","6","1","3","x"," ","x",
			"x","d"," ","j","x"," ","x","x","x","x","x"," ","x",
			"x","x","I","x","x"," "," "," "," "," "," "," ","x",
			"x"," ","7"," ","x","x","K","x","x","x","I","x","x",
			"x","r","b","i","x"," ","h"," ","x","i","8","j","x",
			"x","r"," ","i","x"," "," "," ","x","i","i","i","x",
			"x","x","x","x","x","x","x","x","x","x","x","x","x"
		};
	}
}
